; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c2-s1-p11-a3)

(:domain logistics)

(:objects a0 a1 a2 - airplane
          c0 c1 - city
          t0 t1 t2 t3 - truck
          l0-0 l1-0 - airport
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l1-0 c1)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l1-0)
    (at t3 l1-0)
    (at p0 l1-0)
    (at p1 l0-0)
    (at p2 l1-0)
    (at p3 l0-0)
    (at p4 l0-0)
    (at p5 l1-0)
    (at p6 l0-0)
    (at p7 l1-0)
    (at p8 l0-0)
    (at p9 l0-0)
    (at p10 l0-0)
    (at a0 l1-0)
    (at a1 l0-0)
    (at a2 l0-0)
)

(:goal
    (and
        (at p0 l0-0)
        (at p1 l0-0)
        (at p2 l0-0)
        (at p3 l0-0)
        (at p4 l1-0)
        (at p5 l1-0)
        (at p6 l1-0)
        (at p7 l0-0)
        (at p8 l1-0)
        (at p9 l1-0)
        (at p10 l1-0)
    )
)
)

; plan
1. (load a0 p0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a0)
   goals met: 3 of 11
2. (load a0 p2 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 3 of 11
3. (load a0 p7 l1-0)
   deleted: (at p7 l1-0)
   added: (in p7 a0)
   goals met: 3 of 11
4. (load a2 p10 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 a2)
   goals met: 3 of 11
5. (load a2 p4 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a2)
   goals met: 3 of 11
6. (load a2 p6 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a2)
   goals met: 3 of 11
7. (load a2 p8 l0-0)
   deleted: (at p8 l0-0)
   added: (in p8 a2)
   goals met: 3 of 11
8. (load a2 p9 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 a2)
   goals met: 3 of 11
9. (load t0 p1 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 2 of 11
10. (load t0 p3 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 1 of 11
11. (load t1 p5 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 t1)
   goals met: 0 of 11
12. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 11
13. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 11
14. (unload a0 p0 l0-0)
   deleted: (in p0 a0)
   added: (at p0 l0-0)
   goals met: 1 of 11
15. (unload a0 p2 l0-0)
   deleted: (in p2 a0)
   added: (at p2 l0-0)
   goals met: 2 of 11
16. (unload a0 p7 l0-0)
   deleted: (in p7 a0)
   added: (at p7 l0-0)
   goals met: 3 of 11
17. (unload a2 p10 l1-0)
   deleted: (in p10 a2)
   added: (at p10 l1-0)
   goals met: 4 of 11
18. (unload a2 p4 l1-0)
   deleted: (in p4 a2)
   added: (at p4 l1-0)
   goals met: 5 of 11
19. (unload a2 p6 l1-0)
   deleted: (in p6 a2)
   added: (at p6 l1-0)
   goals met: 6 of 11
20. (unload a2 p8 l1-0)
   deleted: (in p8 a2)
   added: (at p8 l1-0)
   goals met: 7 of 11
21. (unload a2 p9 l1-0)
   deleted: (in p9 a2)
   added: (at p9 l1-0)
   goals met: 8 of 11
22. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 8 of 11
23. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 8 of 11
24. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 8 of 11
25. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 8 of 11
26. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 8 of 11
27. (unload t0 p1 l0-0)
   deleted: (in p1 t0)
   added: (at p1 l0-0)
   goals met: 9 of 11
28. (unload t0 p3 l0-0)
   deleted: (in p3 t0)
   added: (at p3 l0-0)
   goals met: 10 of 11
29. (unload t1 p5 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 11 of 11
